#include <stdio.h>

int main() {
    int n, sum = 0, product = 1;// змінні, які використовуються для зберігання результатів обчислень у програмі.
    printf("Введіть кількість елементів масиву: ");
    scanf("%d", &n);
    int a[n];
    printf("Введіть елементи масиву: ");
    
    for(int i = 0; i < n; i++) {
        scanf("%d", &a[i]);
    }
    // Знаходимо суму елементів з непарними номерами
    for(int i = 0; i < n; i += 2) {
        sum += a[i];
    }
    // Знаходимо добуток елементів між першим та останнім від'ємним елементами
    int first_negative = -1, last_negative = -1;
    for(int i = 0; i < n; i++) {
        if(a[i] < 0) //Перевіряємо, чи поточний елемент масиву a від'ємний        
         {
            if(first_negative == -1) {
                first_negative = i;//Перевіряємо, чи було знайдено перший від'ємний елемент масиву
            } else {
                last_negative = i;
            }//знаходження другого відємного елемента масиву
        }
    }
    if(first_negative != -1 && last_negative != -1) {
        for(int i = first_negative + 1; i < last_negative; i++) {
            product *= a[i];//зберігається добуток між від'ємними елементами
        }
    } else {
        printf("У масиві відсутні від'ємні елементи.");
    }

    printf("Сума елементів з непарними номерами: %d\n", sum);
    printf("Добуток елементів масиву, розташованих між першим й останнім від’ємними елементами: %d\n", product);

    return 0;
}